balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GB106.PIC
        <edc:SFRDef edc:access="nnnnnnnnnn---nnn" edc:cname="CNEN2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000---000" edc:name="CNEN2" edc:nzwidth="0x10" edc:por="0000000000---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16IE" edc:desc="" edc:mask="0x1" edc:name="CN16IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17IE" edc:desc="" edc:mask="0x1" edc:name="CN17IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18IE" edc:desc="" edc:mask="0x1" edc:name="CN18IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN22IE" edc:desc="" edc:mask="0x1" edc:name="CN22IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23IE" edc:desc="" edc:mask="0x1" edc:name="CN23IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24IE" edc:desc="" edc:mask="0x1" edc:name="CN24IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25IE" edc:desc="" edc:mask="0x1" edc:name="CN25IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26IE" edc:desc="" edc:mask="0x1" edc:name="CN26IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27IE" edc:desc="" edc:mask="0x1" edc:name="CN27IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28IE" edc:desc="" edc:mask="0x1" edc:name="CN28IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29IE" edc:desc="" edc:mask="0x1" edc:name="CN29IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30IE" edc:desc="" edc:mask="0x1" edc:name="CN30IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31IE" edc:desc="" edc:mask="0x1" edc:name="CN31IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------------n" edc:cname="CNEN3" edc:desc="" edc:impl="0x0001" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="CNEN3" edc:nzwidth="0x10" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32IE" edc:desc="" edc:mask="0x1" edc:name="CN32IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-nnnnnnnn-" edc:cname="CNEN4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-00000000-" edc:name="CNEN4" edc:nzwidth="0x10" edc:por="000000-00000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49IE" edc:desc="" edc:mask="0x1" edc:name="CN49IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50IE" edc:desc="" edc:mask="0x1" edc:name="CN50IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51IE" edc:desc="" edc:mask="0x1" edc:name="CN51IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52IE" edc:desc="" edc:mask="0x1" edc:name="CN52IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53IE" edc:desc="" edc:mask="0x1" edc:name="CN53IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54IE" edc:desc="" edc:mask="0x1" edc:name="CN54IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55IE" edc:desc="" edc:mask="0x1" edc:name="CN55IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56IE" edc:desc="" edc:mask="0x1" edc:name="CN56IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN58IE" edc:desc="" edc:mask="0x1" edc:name="CN58IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59IE" edc:desc="" edc:mask="0x1" edc:name="CN59IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60IE" edc:desc="" edc:mask="0x1" edc:name="CN60IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61IE" edc:desc="" edc:mask="0x1" edc:name="CN61IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62IE" edc:desc="" edc:mask="0x1" edc:name="CN62IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63IE" edc:desc="" edc:mask="0x1" edc:name="CN63IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------n-nn--nn" edc:cname="CNEN5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0-00--00" edc:name="CNEN5" edc:nzwidth="0x10" edc:por="--------0-00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64IE" edc:desc="" edc:mask="0x1" edc:name="CN64IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65IE" edc:desc="" edc:mask="0x1" edc:name="CN65IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN68IE" edc:desc="" edc:mask="0x1" edc:name="CN68IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69IE" edc:desc="" edc:mask="0x1" edc:name="CN69IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN71IE" edc:desc="" edc:mask="0x1" edc:name="CN71IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPU1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPU1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN0PUE" edc:desc="" edc:mask="0x1" edc:name="CN0PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN1PUE" edc:desc="" edc:mask="0x1" edc:name="CN1PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN2PUE" edc:desc="" edc:mask="0x1" edc:name="CN2PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PUE" edc:desc="" edc:mask="0x1" edc:name="CN3PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PUE" edc:desc="" edc:mask="0x1" edc:name="CN4PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PUE" edc:desc="" edc:mask="0x1" edc:name="CN5PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PUE" edc:desc="" edc:mask="0x1" edc:name="CN6PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PUE" edc:desc="" edc:mask="0x1" edc:name="CN7PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8PUE" edc:desc="" edc:mask="0x1" edc:name="CN8PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9PUE" edc:desc="" edc:mask="0x1" edc:name="CN9PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10PUE" edc:desc="" edc:mask="0x1" edc:name="CN10PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11PUE" edc:desc="" edc:mask="0x1" edc:name="CN11PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12PUE" edc:desc="" edc:mask="0x1" edc:name="CN12PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13PUE" edc:desc="" edc:mask="0x1" edc:name="CN13PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14PUE" edc:desc="" edc:mask="0x1" edc:name="CN14PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15PUE" edc:desc="" edc:mask="0x1" edc:name="CN15PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnn---nnn" edc:cname="CNPU2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000---000" edc:name="CNPU2" edc:nzwidth="0x10" edc:por="0000000000---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PUE" edc:desc="" edc:mask="0x1" edc:name="CN16PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17PUE" edc:desc="" edc:mask="0x1" edc:name="CN17PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18PUE" edc:desc="" edc:mask="0x1" edc:name="CN18PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN22PUE" edc:desc="" edc:mask="0x1" edc:name="CN22PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PUE" edc:desc="" edc:mask="0x1" edc:name="CN23PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24PUE" edc:desc="" edc:mask="0x1" edc:name="CN24PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25PUE" edc:desc="" edc:mask="0x1" edc:name="CN25PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26PUE" edc:desc="" edc:mask="0x1" edc:name="CN26PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27PUE" edc:desc="" edc:mask="0x1" edc:name="CN27PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28PUE" edc:desc="" edc:mask="0x1" edc:name="CN28PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29PUE" edc:desc="" edc:mask="0x1" edc:name="CN29PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30PUE" edc:desc="" edc:mask="0x1" edc:name="CN30PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31PUE" edc:desc="" edc:mask="0x1" edc:name="CN31PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------------n" edc:cname="CNPU3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="CNPU3" edc:nzwidth="0x10" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PUE" edc:desc="" edc:mask="0x1" edc:name="CN32PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nnnnnnnnn-" edc:cname="CNPU4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-00000000-" edc:name="CNPU4" edc:nzwidth="0x10" edc:por="000000-00000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49PUE" edc:desc="" edc:mask="0x1" edc:name="CN49PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PUE" edc:desc="" edc:mask="0x1" edc:name="CN50PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PUE" edc:desc="" edc:mask="0x1" edc:name="CN51PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PUE" edc:desc="" edc:mask="0x1" edc:name="CN52PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PUE" edc:desc="" edc:mask="0x1" edc:name="CN53PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PUE" edc:desc="" edc:mask="0x1" edc:name="CN54PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PUE" edc:desc="" edc:mask="0x1" edc:name="CN55PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PUE" edc:desc="" edc:mask="0x1" edc:name="CN56PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN58PUE" edc:desc="" edc:mask="0x1" edc:name="CN58PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PUE" edc:desc="" edc:mask="0x1" edc:name="CN59PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PUE" edc:desc="" edc:mask="0x1" edc:name="CN60PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PUE" edc:desc="" edc:mask="0x1" edc:name="CN61PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PUE" edc:desc="" edc:mask="0x1" edc:name="CN62PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PUE" edc:desc="" edc:mask="0x1" edc:name="CN63PUE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------n-nn--nn" edc:cname="CNPU5" edc:desc="" edc:impl="0xb3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------0-00--00" edc:name="CNPU5" edc:nzwidth="0x10" edc:por="--------0-00--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PUE" edc:desc="" edc:mask="0x1" edc:name="CN64PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PUE" edc:desc="" edc:mask="0x1" edc:name="CN65PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN68PUE" edc:desc="" edc:mask="0x1" edc:name="CN68PUE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PUE" edc:desc="" edc:mask="0x1" edc:name="CN69PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN71PUE" edc:desc="" edc:mask="0x1" edc:name="CN71PUE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:SFRDef edc:access="n----------nnnn-" edc:cname="INTCON1" edc:desc="" edc:impl="0x805e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----------0000-" edc:name="INTCON1" edc:nzwidth="0x10" edc:por="0----------0000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OSCFAIL" edc:desc="" edc:mask="0x1" edc:name="OSCFAIL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="STKERR" edc:desc="" edc:mask="0x1" edc:name="STKERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDRERR" edc:desc="" edc:mask="0x1" edc:name="ADDRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MATHERR" edc:desc="" edc:mask="0x1" edc:name="MATHERR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="NSTDIS" edc:desc="" edc:mask="0x1" edc:name="NSTDIS" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nr---------nnnnn" edc:cname="INTCON2" edc:desc="" edc:impl="0xc007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---------00000" edc:name="INTCON2" edc:nzwidth="0x10" edc:por="00---------00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0EP" edc:desc="" edc:mask="0x1" edc:name="INT0EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1EP" edc:desc="" edc:mask="0x1" edc:name="INT1EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2EP" edc:desc="" edc:mask="0x1" edc:name="INT2EP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT3EP" edc:desc="" edc:mask="0x1" edc:name="INT3EP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4EP" edc:desc="" edc:mask="0x1" edc:name="INT4EP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="DISI" edc:desc="" edc:mask="0x1" edc:name="DISI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ALTIVT" edc:desc="" edc:mask="0x1" edc:name="ALTIVT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnn-nnnn" edc:cname="IFS0" edc:desc="" edc:impl="0x3fef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000-0000" edc:name="IFS0" edc:nzwidth="0x10" edc:por="--000000000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPF1IF" edc:desc="" edc:mask="0x1" edc:name="SPF1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IF" edc:desc="" edc:mask="0x1" edc:name="SPI1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
