balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GB106.PIC
  <!--remappable inputs-->
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="INT4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T2CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T3CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T4CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="T5CK"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="IC9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFA"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="OCFB"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U1CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U2CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U3CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4RX"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="U4CTS"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK1IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS1IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS2IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SDI3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SCK3IN"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="in">
      <edc:VirtualPin edc:name="SS3IN"/>
    </edc:RemappablePin>
    <!--remappable outputs-->
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C1OUT" edc:ppsval="1"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C2OUT" edc:ppsval="2"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1TX" edc:ppsval="3"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U1RTS" edc:ppsval="4"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2TX" edc:ppsval="5"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U2RTS" edc:ppsval="6"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO1" edc:ppsval="7"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK1OUT" edc:ppsval="8"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS1OUT" edc:ppsval="9"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO2" edc:ppsval="10"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK2OUT" edc:ppsval="11"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS2OUT" edc:ppsval="12"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC1" edc:ppsval="18"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC2" edc:ppsval="19"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC3" edc:ppsval="20"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC4" edc:ppsval="21"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC5" edc:ppsval="22"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC6" edc:ppsval="23"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC7" edc:ppsval="24"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC8" edc:ppsval="25"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3TX" edc:ppsval="28"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U3RTS" edc:ppsval="29"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4TX" edc:ppsval="30"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="U4RTS" edc:ppsval="31"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SDO3" edc:ppsval="32"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SCK3OUT" edc:ppsval="33"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="SS3OUT" edc:ppsval="34"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="OC9" edc:ppsval="35"/>
    </edc:RemappablePin>
    <edc:RemappablePin edc:direction="out">
      <edc:VirtualPin edc:name="C3OUT" edc:ppsval="36"/>
    </edc:RemappablePin>
  </edc:PinList>
</edc:PIC>